package com.ivan.course.constants;

import java.util.List;

public class ConstantsCollection {
    private static final List<String> LANGUAGES = List.of(
            "Африкаанс", "Албанська", "Амхарська", "Арабська", "Вірменська", "Азербайджанська",
            "Баскська", "Білоруська", "Бенгальська", "Боснійська", "Болгарська", "Каталонська",
            "Себуанська", "Чичева", "Китайська", "Корсиканська", "Хорватська", "Чеська", "Данська",
            "Голландська", "Англійська", "Есперанто", "Естонська", "Філіппінська", "Фінська", "Французька",
            "Фризька", "Галісійська", "Грузинська", "Німецька", "Грецька", "Гуджараті", "Гаїтянська",
            "Хауса", "Гавайська", "Іврит", "Гінді", "Хмонг", "Угорська", "Ісландська", "Ігбо",
            "Індонезійська", "Ірландська", "Італійська", "Японська", "Яванська", "Каннада", "Казахська",
            "Кхмерська", "Корейська", "Курдська", "Киргизька", "Лаоська", "Латинська", "Латиська",
            "Литовська", "Люксембурзька", "Македонська", "Малагасійська", "Малайська", "Малаялам",
            "Мальтійська", "Маорі", "Маратхі", "Монгольська", "Непальська", "Норвезька", "Орія",
            "Пушту", "Перська", "Польська", "Португальська", "Панджабі", "Румунська", "Російська",
            "Самоанська", "Шотландська гельська", "Сербська", "Сесото", "Шона", "Сіндхі", "Сингальська",
            "Словацька", "Словенська", "Сомалійська", "Іспанська", "Суданська", "Суахілі", "Шведська",
            "Таджицька", "Тамільська", "Телугу", "Тайська", "Турецька", "Українська", "Урду", "Узбецька",
            "В’єтнамська", "Валлійська", "Коса", "Їдиш", "Йоруба", "Зулу"
    );

    private static final List<String> LANGUAGE_LEVELS = List.of("A1","A2","B1","B2","C1");

    private static final List<String> STUDENT_ROLES = List.of("student");

    private static final List<String> TEACHER_ROLES = List.of("teacher");

    public static List<String> getLanguages() {
        return LANGUAGES.stream().sorted().toList();
    }

    public static List<String> getLanguageLevels() {
        return LANGUAGE_LEVELS;
    }

    public static List<String> getStudentRoles() {
        return STUDENT_ROLES;
    }

    public static List<String> getTeacherRoles() {
        return TEACHER_ROLES;
    }
}
